# UAS DATAWAREHOUSE
## RICKO RINALDY
## 11160940000031

In [2]:
import pandas as pd
import pandas.io.sql as sqlio
import psycopg2
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT

### 2. Buat databaset dengan nama db_uas!

In [ ]:
conn = psycopg2.connect("dbname=tweet user=postgres password=5909509")
conn.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT)
cur = conn.cursor()
cur.execute("create database db_uas")

In [58]:
conn = psycopg2.connect("dbname=db_uas user=postgres password=5909509")
cur = conn.cursor()

### 3. Buat table-table diatas pada db_uas!

In [26]:
cur.execute('''
           create table if not exists ms_grade(
           grade_id char(1) primary key,
           nilai varchar(7),
           discount varchar(3));
           
           create table if not exists ms_program(
           program_id varchar(5) primary key,
           program_name varchar (20),
           fee int,
           program_duration int);
           
           create table if not exists ms_student(
           student_id int primary key,
           student_name varchar(20),
           student_address varchar(15),
           student_phone varchar(13),
           student_email varchar(30),
           student_gender varchar(6),
           student_birth date);
           
           create table if not exists ms_tutor(
           tutor_id varchar(4) primary key,
           tutor_name varchar(20),
           tutor_address varchar(15),
           tutor_phone varchar(13),
           tutor_email varchar(30),
           tutor_gender varchar(6),
           tutor_birth date);
           
           create table if not exists tr_jadwal(
           schedule_id varchar(5) primary key,
           day_ varchar(10),
           time_ varchar(11),
           prog_id varchar(5) references ms_program(program_id),
           room int,
           tutor_id varchar(4) references ms_tutor(tutor_id));
           
           create table if not exists tr_regist(
           regist_id varchar(6) primary key,
           student_id int references ms_student(student_id),
           jadwal_id varchar(5) references tr_jadwal(schedule_id),
           grade_id char(1) references ms_grade(grade_id));
           
           create table if not exists tr_payment(
           payment_id varchar(5) primary key,
           regist_id varchar(6) references tr_regist(regist_id),
           total_payment int,
           payment_date date);
           
           create table if not exists tr_result(
           result_id varchar(6) primary key,
           program_id varchar(5) references ms_program(program_id),
           student_id int references ms_student(student_id),
           written_test char(1),
           oral_test char(1),
           note varchar(9));
           
           create table if not exists trd_absensi(
           absensi_id varchar(4) primary key,
           student_id int references ms_student(student_id),
           pr1 char(1),
           pr2 char(1),
           pr3 char(1),
           pr4 char(1),
           pr5 char(1),
           pr6 char(1),
           pr7 char(1),
           pr8 char(1),
           pr9 char(1),
           pr10 char(1),
           pr11 char(1),
           pr12 char(1));
           ''')
conn.commit()

In [27]:
cur.execute('''
            insert into ms_grade (grade_id, nilai, discount) values
            ('A', '85-100', '10%'),
            ('B', '75-84', '5%'),
            ('C', '0-75', '0%');
            
            insert into ms_program (program_id, program_name, fee, program_duration) values
            ('PC001', 'Calculus', 1500000, 12),
            ('PG001', 'Machine Learning', 1000000, 12),
            ('PD001', 'Bioinformatics', 2000000, 12);
            
            insert into ms_student 
            (student_id, student_name, student_address, student_phone, student_email, student_gender, student_birth)
            values
            (11111, 'Agnes', 'Semanggi II', '08112233441', 'agnes@gmail.com', 'Female', '12/12/99'),
            (11112, 'Udin', 'Ciputat Raya', '08123456789', 'udinuhuy@gmail.com', 'Male', '09/01/98'),
            (11113, 'Wiya', 'Legoso', '08312345678', 'wiyabgt@gmail.com', 'Female', '03/15/99'),
            (11114, 'Marsha', 'Pisangan', '08765472182', 'Marshabear@gmail.com', 'Female', '03/14/99'),
            (11115, 'Lily', 'Poncol', '08223343456', 'lilyan@gmail.com', 'Female', '08/15/99'),
            (11116, 'Upin', 'Pamulang', '08213003003', 'upinnyaipin@gmail.com', 'Male', '04/16/98'),
            (11117, 'Ipin', 'Serpong', '08220033445', 'ipinnyaupin@gmail.com', 'Male', '04/16/98'),
            (11118, 'Reza', 'Cimanggis', '08565656561', 'rezaganz@gmail.com', 'Male', '11/07/99'),
            (11119, 'Dimas', 'Legoso', '08818818818', 'dimasgendut@gmail.com', 'Male', '06/03/99'),
            (11110, 'Ridwan', 'Parung', '08212398767', 'ridwan@gmail.com', 'Male', '09/12/99');
            
            insert into ms_tutor
            (tutor_id, tutor_name, tutor_address, tutor_phone, tutor_email, tutor_gender, tutor_birth)
            values
            ('A211', 'Agus', 'Bintaro Raya', '08213243546', 'agus@gmail.com', 'Male', '09/12/88'),
            ('A212', 'Bella', 'Cileungsi', '08222121212', 'bella@gmail.com', 'Female', '10/01/87'),
            ('A213', 'Alvan', 'Ciputat', '08123344334', 'alvan@gmail.com', 'Male', '02/15/90'),
            ('A214', 'Alen', 'Cisauk', '08229090909', 'alen@gmail.com', 'Male', '01/14/89'),
            ('A215', 'Sarah', 'Poncol', '08213243546', 'sarah@gmail.com', 'Female', '10/15/90');
            
            insert into tr_jadwal
            (schedule_id, day_, time_, prog_id, room, tutor_id) values
            ('J0001', 'Monday', '13.00-15.00', 'PC001', 101, 'A211'),
            ('J0002', 'Monday', '15.00-17.00', 'PG001', 105, 'A212'),
            ('J0003', 'Tuesday', '09.00-11.00', 'PD001', 101, 'A213'),
            ('J0004', 'Wednesday', '13.00-15.00', 'PG001', 103, 'A214'),
            ('J0005', 'Wednesday', '15.00-17.00', 'PD001', 104, 'A213'),
            ('J0006', 'Thursday', '09.00-11.00', 'PG001', 102, 'A212'),
            ('J0007', 'Friday', '15.00-17.00', 'PC001', 101, 'A215'),
            ('J0008', 'Tuesday', '13.00-15.00', 'PG001', 104, 'A212');
            
            insert into tr_regist (regist_id, student_id, jadwal_id, grade_id) values
            ('reg001', 11111, 'J0005', 'B'),
            ('reg002', 11112, 'J0002', 'A'),
            ('reg003', 11113, 'J0001', 'B'),
            ('reg004', 11114, 'J0003', 'B'),
            ('reg005', 11115, 'J0005', 'C'),
            ('reg006', 11116, 'J0004', 'B'),
            ('reg007', 11117, 'J0007', 'C'),
            ('reg008', 11118, 'J0008', 'C'),
            ('reg009', 11119, 'J0001', 'C'),
            ('reg010', 11110, 'J0005', 'B');
            
            insert into tr_payment (payment_id, regist_id, total_payment, payment_date) values
            ('PO101', 'reg001', 1900000, '03/01/2008'),
            ('PO102', 'reg002', 900000, '10/01/2008'),
            ('PO103', 'reg003', 1425000, '11/01/2008'),
            ('PO104', 'reg004', 1900000, '02/02/2008'),
            ('PO105', 'reg005', 2000000, '05/02/2008'),
            ('PO106', 'reg006', 950000, '11/02/2008'),
            ('PO107', 'reg007', 1500000, '08/01/2008'),
            ('PO108', 'reg008', 1000000, '08/02/2008'),
            ('PO109', 'reg009', 1500000, '09/01/2008'),
            ('PO110', 'reg010', 1900000, '12/02/2008');
            
            insert into tr_result (result_id, program_id, student_id, written_test, oral_test, note) values
            ('res001', 'PD001', 11111, NULL, 'B', 'GOOD'),
            ('res002', 'PG001', 11112, 'C', 'B', 'AVERAGE'),
            ('res003', 'PC001', 11113, 'B', 'A', 'GOOD'),
            ('res004', 'PD001', 11114, 'C', 'C', NULL),
            ('res005', 'PD001', 11115, 'B', NULL, 'GOOD'),
            ('res006', 'PG001', 11116, 'C', 'C', NULL),
            ('res007', 'PC001', 11117, NULL, 'A', 'EXCELLENT'),
            ('res008', 'PG001', 11118, 'A', 'C', NULL),
            ('res009', 'PC001', 11119, 'A', 'B', 'GOOD'),
            ('res010', 'PD001', 11110, 'B', 'C', 'AVERAGE');
            
            insert into trd_absensi
            (absensi_id, student_id, pr1, pr2, pr3, pr4, pr5, pr6, pr7, pr8, pr9, pr10, pr11, pr12)
            values
            ('h001', 11111, 'H', 'H', 'H', 'H', 'I', 'H', 'H', 'H', 'H', 'H', 'H', 'H'),
            ('h002', 11112, 'H', 'H', 'H', 'I', 'H', 'H', 'H', 'H', 'H', 'I', 'I', 'H'),
            ('h003', 11113, 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H'),
            ('h004', 11114, 'H', 'H', 'H', 'H', 'H', 'H', 'A', 'H', 'H', 'H', 'A', 'H'),
            ('h005', 11115, 'H', 'I', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H'),
            ('h006', 11116, 'H', 'H', 'H', 'H', 'I', 'H', 'H', 'H', 'H', 'H', 'I', 'H'),
            ('h007', 11117, 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'H'),
            ('h008', 11118, 'I', 'H', 'H', 'H', 'H', 'H', 'I', 'H', 'H', 'H', 'H', 'H'),
            ('h009', 11119, 'H', 'H', 'H', 'A', 'H', 'H', 'H', 'H', 'H', 'H', 'I', 'H'),
            ('h010', 11110, 'H', 'A', 'H', 'H', 'H', 'H', 'H', 'H', 'H', 'A', 'H', 'H');
            ''')
conn.commit()

### 4. Tampilkan keseluruhan table yang sudah dibuat!

In [86]:
sql = "select * from ms_grade;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel ms_grade\n",dat)

	Tabel ms_grade
   grade_id   nilai discount
0        A  85-100      10%
1        B   75-84       5%
2        C    0-75       0%

In [87]:
sql = "select * from ms_program;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel ms_program\n",dat)

	Tabel ms_program
   program_id      program_name      fee  program_duration
0      PC001          Calculus  1500000                12
1      PG001  Machine Learning  1000000                12
2      PD001    Bioinformatics  2000000                12

In [88]:
sql = "select * from ms_student;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel ms_student\n",dat)

	Tabel ms_student
    student_id student_name student_address student_phone  \
0       11111        Agnes     Semanggi II   08112233441
1       11112         Udin    Ciputat Raya   08123456789
2       11113         Wiya          Legoso   08312345678
3       11114       Marsha        Pisangan   08765472182
4       11115         Lily          Poncol   08223343456
5       11116         Upin        Pamulang   08213003003
6       11117         Ipin         Serpong   08220033445
7       11118         Reza       Cimanggis   08565656561
8       11119        Dimas          Legoso   08818818818
9       11110       Ridwan          Parung   08212398767

           student_email student_gender student_birth
0        agnes@gmail.com         Female    1999-12-12
1     udinuhuy@gmail.com           Male    1998-09-01
2      wiyabgt@gmail.com         Female    1999-03-15
3   Marshabear@gmail.com         Female    1999-03-14
4       lilyan@gmail.com         Female    1999-08-15
5  upinnyaipin@gmail.com           Male    1998-04-16
6  ipinnyaupin@gmail.com           Male    1998-04-16
7     rezaganz@gmail.com           Male    1999-11-07
8  dimasgendut@gmail.com           Male    1999-06-03
9       ridwan@gmail.com           Male    1999-09-12

In [89]:
sql = "select * from ms_tutor;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel ms_tutor\n",dat)

	Tabel ms_tutor
   tutor_id tutor_name tutor_address  tutor_phone      tutor_email  \
0     A211       Agus  Bintaro Raya  08213243546   agus@gmail.com
1     A212      Bella     Cileungsi  08222121212  bella@gmail.com
2     A213      Alvan       Ciputat  08123344334  alvan@gmail.com
3     A214       Alen        Cisauk  08229090909   alen@gmail.com
4     A215      Sarah        Poncol  08213243546  sarah@gmail.com

  tutor_gender tutor_birth
0         Male  1988-09-12
1       Female  1987-10-01
2         Male  1990-02-15
3         Male  1989-01-14
4       Female  1990-10-15

In [90]:
sql = "select * from tr_jadwal;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel tr_jadwal\n",dat)

	Tabel tr_jadwal
   schedule_id       day_        time_ prog_id  room tutor_id
0       J0001     Monday  13.00-15.00   PC001   101     A211
1       J0002     Monday  15.00-17.00   PG001   105     A212
2       J0003    Tuesday  09.00-11.00   PD001   101     A213
3       J0004  Wednesday  13.00-15.00   PG001   103     A214
4       J0005  Wednesday  15.00-17.00   PD001   104     A213
5       J0006   Thursday  09.00-11.00   PG001   102     A212
6       J0007     Friday  15.00-17.00   PC001   101     A215
7       J0008    Tuesday  13.00-15.00   PG001   104     A212

In [91]:
sql = "select * from tr_payment;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel tr_payment\n",dat)

	Tabel tr_payment
   payment_id regist_id  total_payment payment_date
0      PO101    reg001        1900000   2008-03-01
1      PO102    reg002         900000   2008-10-01
2      PO103    reg003        1425000   2008-11-01
3      PO104    reg004        1900000   2008-02-02
4      PO105    reg005        2000000   2008-05-02
5      PO106    reg006         950000   2008-11-02
6      PO107    reg007        1500000   2008-08-01
7      PO108    reg008        1000000   2008-08-02
8      PO109    reg009        1500000   2008-09-01
9      PO110    reg010        1900000   2008-12-02

In [92]:
sql = "select * from tr_regist;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel tr_regist\n",dat)

	Tabel tr_regist
   regist_id  student_id jadwal_id grade_id
0    reg001       11111     J0005        B
1    reg002       11112     J0002        A
2    reg003       11113     J0001        B
3    reg004       11114     J0003        B
4    reg005       11115     J0005        C
5    reg006       11116     J0004        B
6    reg007       11117     J0007        C
7    reg008       11118     J0008        C
8    reg009       11119     J0001        C
9    reg010       11110     J0005        B

In [93]:
sql = "select * from tr_result;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel tr_result\n",dat)

	Tabel tr_result
   result_id program_id  student_id written_test oral_test       note
0    res001      PD001       11111         None         B       GOOD
1    res002      PG001       11112            C         B    AVERAGE
2    res003      PC001       11113            B         A       GOOD
3    res004      PD001       11114            C         C       None
4    res005      PD001       11115            B      None       GOOD
5    res006      PG001       11116            C         C       None
6    res007      PC001       11117         None         A  EXCELLENT
7    res008      PG001       11118            A         C       None
8    res009      PC001       11119            A         B       GOOD
9    res010      PD001       11110            B         C    AVERAGE

In [94]:
sql = "select * from trd_absensi;"
dat = sqlio.read_sql_query(sql, conn)
print("\tTabel trd_absensi\n",dat)

	Tabel trd_absensi
   absensi_id  student_id pr1 pr2 pr3 pr4 pr5 pr6 pr7 pr8 pr9 pr10 pr11 pr12
0       h001       11111   H   H   H   H   I   H   H   H   H    H    H    H
1       h002       11112   H   H   H   I   H   H   H   H   H    I    I    H
2       h003       11113   H   H   H   H   H   H   H   H   H    H    H    H
3       h004       11114   H   H   H   H   H   H   A   H   H    H    A    H
4       h005       11115   H   I   H   H   H   H   H   H   H    H    H    H
5       h006       11116   H   H   H   H   I   H   H   H   H    H    I    H
6       h007       11117   H   H   H   H   H   H   H   H   H    H    H    H
7       h008       11118   I   H   H   H   H   H   I   H   H    H    H    H
8       h009       11119   H   H   H   A   H   H   H   H   H    H    I    H
9       h010       11110   H   A   H   H   H   H   H   H   H    A    H    H

### 5. Tampilkan daftar tutor yang terdiri atas Tutor_id, Tutor_name, Tutor_address, Tutor_email!

In [95]:
sql = "select tutor_id, tutor_name, tutor_address, tutor_email from ms_tutor;"
dat = sqlio.read_sql_query(sql, conn)
print(dat)

  tutor_id tutor_name tutor_address      tutor_email
0     A211       Agus  Bintaro Raya   agus@gmail.com
1     A212      Bella     Cileungsi  bella@gmail.com
2     A213      Alvan       Ciputat  alvan@gmail.com
3     A214       Alen        Cisauk   alen@gmail.com
4     A215      Sarah        Poncol  sarah@gmail.com

### 6. Tampilkan nama tutor yang memiliki umur paling muda dan paling tua!

In [69]:
cur.execute("select tutor_name from ms_tutor \
            where tutor_birth=(select max(tutor_birth) from ms_tutor) or tutor_birth=(select min(tutor_birth) from ms_tutor);")
tutor = cur.fetchall()
nama = [i[0] for i in tutor]
print(f"Nama tutor yang paling muda adalah {nama[1]}")
print(f"Nama tutor yang paling tua adalah {nama[0]}")

Nama tutor yang paling muda adalah Sarah
Nama tutor yang paling tua adalah Bella

### 7. Tampilkan kode payment, kode registrasi, jumlah pembayaran dan nama student yang melakukan pembayaran diantara 1.000.000 dan 2.000.000!

In [82]:
sql = "select payment_id, tr_payment.regist_id, total_payment, student_name \
from tr_payment, tr_regist, ms_student \
where ms_student.student_id=tr_regist.student_id and tr_payment.regist_id=tr_regist.regist_id and total_payment>=1000000 and total_payment<=2000000"
dat = sqlio.read_sql_query(sql, conn)
print(dat)

  payment_id regist_id  total_payment student_name
0      PO101    reg001        1900000        Agnes
1      PO103    reg003        1425000         Wiya
2      PO104    reg004        1900000       Marsha
3      PO105    reg005        2000000         Lily
4      PO107    reg007        1500000         Ipin
5      PO108    reg008        1000000         Reza
6      PO109    reg009        1500000        Dimas
7      PO110    reg010        1900000       Ridwan

### 8. Tampilkan seluruh student yang tinggal di Legoso atau Parung!

In [71]:
cur.execute("select student_name from ms_student \
            where student_address='Legoso' or student_address='Parung';")
tutor = cur.fetchall()
murid = [i[0] for i in tutor]
print(f"Nama tutor yang tinggal di legoso atau parung adalah {', '.join(murid)}")

Nama tutor yang tinggal di legoso atau parung adalah Wiya, Dimas, Ridwan

### 9. Tampilkan jumlah ruangan yang terpakai pada hari Senin dan Selasa serta sebutkan nama ruanganya dan kegunaannya!

In [72]:
cur.execute("select count(day_) from tr_jadwal where day_ in ('Monday', 'Tuesday');")
jumlah = cur.fetchone()[0]
print(f"jumlah ruangan yang dipakai pada hari senin dan selasa ada {jumlah} ruangan")
sql = "select day_, room, program_name from tr_jadwal, ms_program \
where day_ in ('Monday', 'Tuesday') and tr_jadwal.prog_id=ms_program.program_id"
dat = sqlio.read_sql_query(sql, conn)
dat

jumlah ruangan yang dipakai pada hari senin dan selasa ada 4 ruangan

      day_  room      program_name
0   Monday   101          Calculus
1  Tuesday   104  Machine Learning
2   Monday   105  Machine Learning
3  Tuesday   101    Bioinformatics

### 10. Tampilkan minimal payment, maksimal payment dan rata-rata payment!

In [73]:
cur.execute("select max(total_payment), min(total_payment), avg(total_payment) from tr_payment;")
pay = cur.fetchone()
print(f"pembayaran paling mahal sebesar {pay[0]}")
print(f"pembayaran paling murah sebesar {pay[1]}")
print(f"rata-rata pembayran sebesar {int(pay[2])}")

pembayaran paling mahal sebesar 2000000
pembayaran paling murah sebesar 900000
rata-rata pembayran sebesar 1497500

### 11. Tampilkan Schdule_id berserta Tutor_id dan nama tutor nya yang mengajarkan program PC001!

In [74]:
sql = "select schedule_id, tr_jadwal.tutor_id, tutor_name from tr_jadwal, ms_tutor \
where tr_jadwal.tutor_id=ms_tutor.tutor_id and prog_id='PC001'"
dat = sqlio.read_sql_query(sql, conn)
print("Program PC001")
dat

Program PC001

  schedule_id tutor_id tutor_name
0       J0001     A211       Agus
1       J0007     A215      Sarah

### 12. Tentukan student yang mendapatkan diskon paling besar!

In [75]:
cur.execute("select student_name from tr_regist, ms_student \
            where tr_regist.student_id=ms_student.student_id and grade_id='A';")
murid = [i[0] for i in cur.fetchall()]
print("murid yang mendapatkan diskon terbesar adalah", " ".join(murid))

murid yang mendapatkan diskon terbesar adalah Udin

### 13. Carilah pertemuan yang paling sedikit jumlah student yang masuk!

In [76]:
kecil = 1000
pertemuan = 1
for i in range(12):
    cur.execute(f"select count(pr{i+1}) from trd_absensi where pr{i+1}='H'")
    kehadiran = cur.fetchone()[0]
    if kehadiran<kecil:
        kecil = kehadiran
        pertemuan = i+1
print(f"pertemuan ke-{pertemuan} paling sedikit murid yang masuk yaitu {kecil} orang")

pertemuan ke-11 paling sedikit murid yang masuk yaitu 6 orang

### 14. Tampilkan nama student yang paling rajin masuk!

In [77]:
sql = "select * from trd_absensi;"
dat = sqlio.read_sql_query(sql, conn)
trans = dat.transpose()
id_murid_rajin = []
besar = 0
for i in range(10):
    a=trans[i].str.count('H')
    if sum(a[2:len(a)])>besar:
        besar = sum(a[2:len(a)])
        id_murid_rajin.clear()
        id_murid_rajin.append(dat['student_id'][i])
    elif sum(a[2:14])==besar:
        id_murid_rajin.append(dat['student_id'][i])
id_murid_rajin = tuple(id_murid_rajin)
cur.execute(f"select student_name from ms_student where student_id in {id_murid_rajin}")
print("murid yang rajin masuk adalah", ', '.join([i[0] for i in cur.fetchall()]))

murid yang rajin masuk adalah Wiya, Ipin

### 15. Tampilkan nama student yang paling malas masuk!

In [78]:
sql = "select * from trd_absensi;"
dat = sqlio.read_sql_query(sql, conn)
trans = dat.transpose()
id_murid_malas = []
kecil = 1000
for i in range(10):
    a=trans[i].str.count('H')
    if sum(a[2:len(a)])<kecil:
        kecil = sum(a[2:len(a)])
        id_murid_malas.clear()
        id_murid_malas.append(dat['student_id'][i])
    elif sum(a[2:14])==kecil:
        id_murid_malas.append(dat['student_id'][i])
cur.execute(f"select student_name from ms_student where student_id in ({id_murid_malas[0]})")
print("murid yang malas masuk adalah", ', '.join([i[0] for i in cur.fetchall()]))

murid yang malas masuk adalah Udin

### 16. Tampilkan nama-nama student yang diajar oleh Tutor Alen!

In [79]:
cur.execute("select student_name from ms_student, ms_tutor, tr_regist, tr_jadwal where \
             tutor_name='Alen' and ms_tutor.tutor_id=tr_jadwal.tutor_id and \
             tr_jadwal.schedule_id=tr_regist.jadwal_id and tr_regist.student_id=ms_student.student_id")
murid = [i[0] for i in cur.fetchall()]
print(f"murid yang diajar oleh tutor Alen adalah", ', '.join(murid))

murid yang diajar oleh tutor Alen adalah Upin

### 17. Tampilkan nama-nama student yang mengikuti program Machine Learning!

In [80]:
cur.execute("select student_name from ms_student, tr_result, ms_program where \
             program_name='Machine Learning' and ms_program.program_id=tr_result.program_id and ms_student.student_id=tr_result.student_id")
murid = [i[0] for i in cur.fetchall()]
print(f"murid yang mengikuti program Machine Learning adalah", ', '.join(murid))

murid yang mengikuti program Machine Learning adalah Udin, Upin, Reza

### 18. Tampilkan nama program dan nama student yang mendapatkan hasil Note Excellent!

In [81]:
cur.execute("select student_name, program_name from ms_student, ms_program, tr_result where \
             note='EXCELLENT' and tr_result.student_id=ms_student.student_id and tr_result.program_id=ms_program.program_id")
data = cur.fetchall()
murid = [i[0] for i in data]
program = [i[1] for i in data]
for i in range(len(data)):
    print(f"{murid[i]} mendapatkan EXCELLENT pada program {program[i]}")

Ipin mendapatkan EXCELLENT pada program Calculus